// 依次输入如下三个学生的学号、高数成绩、物理成绩和英语成绩，然后按照输入顺序再进行输出。

// 输入要求：
// (1)学号为小于30000的一个5位自然数；
// (2)成绩为正浮点数，取值为0到100。
// (3)输入时，学号和三个成绩中间使用英文逗号(',')隔开,每个学生信息输入完成后以回车作为结束。可以不检查学生的学号是否重复和成绩是否有效。

// 输出要求：
// 学号1,高数成绩1,物理成绩1,英语成绩1
// 学号2,高数成绩2,物理成绩2,英语成绩2
// 学号3,高数成绩3,物理成绩3,英语成绩3

// 输出各项以英文逗号(',')隔开，每个成绩输出占7列，其中包含1位小数。

// 示例：
// 输入(各项以英文逗号(',')隔开):
// 20010,90,89.5,100
// 20011,88.5,78,92.5
// 20012,100,69.5,90

#include <stdio.h>

int main() {
    int student_id;
    float math_score, physics_score, english_score;

	int i;
	for (i=0; i<=2; i++) {
		scanf("%d,%f,%f,%f", &student_id, &math_score, &physics_score, &english_score);
    	printf("%d,%7.1f,%7.1f,%7.1f\n", student_id, math_score, physics_score, english_score);
	}

    return 0;
}

